Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: If you have manually extracted the setup files from the installer EXE, use either setup.exe /S or AutoHotkeyU32.exe Installer.ahk /S.
fr: Si les fichiers d'installation ont été extraits manuellement de l'installateur exécutable, utiliser soit setup.exe /S soit AutoHotkeyU32.exe Installer.ahk /S.

source: If you have trouble getting a script to recognize your joystick, one person reported needing to specify a joystick number other than 1 even though only a single joystick was present.
fr: Si vous rencontrez des difficultés pour qu'un script reconnaisse votre joystick, une personne a signalé le besoin de spécifier un numéro de joystick autre que 1 même si un seul joystick était présent.

source: If you launch AutoHotkey from the Start menu or by running AutoHotkey.exe directly (without command line parameters), it will look for a script in one of the locations shown above.
fr: Si AutoHotkey est lancé depuis le menu Démarrer ou en lançant directement AutoHotkey.exe (sans paramètre de ligne de commande), il cherchera un script dans l'un des endroits indiqués ci-dessus.

source: If you run AutoHotkeyU32.exe without parameters, it will look for AutoHotkeyU32.ahk.
fr: Si AutoHotkeyU32.exe est lancé sans paramètres, il cherchera AutoHotkeyU32.ahk.

source: If you still get an error, modify your code some more.
fr: modifier le code encore un peu.

source: If you try something and it gives you an error, study that error.
fr: Si une tentative aboutit à une erreur, étudier cette erreur puis réparer le code.

source: If you want to learn more about that stuff, visit the Run page.
fr: Pour en apprendre plus à ce sujet, voir la page Run.

source: If you were to ignore WinTitle, WinText, it would look like this and cause issues:
fr: Ignorer WinTitle, WinText donnerait le code non fonctionnel suivant :

source: If you've also updated to a newer version of AutoHotkey, find out which version you had before and then check the changelog and compatibility notes.
fr: Si en plus AutoHotkey a été mis à jour vers une version plus récente, trouver la version précédente et lire le journal des changements (changelog) et les notes de compatibilité.

source: If you've switched operating systems, it is likely that something else has also changed and may be affecting your script.
fr: En cas de changement de système d'exploitation, il y a des chances que quelque chose d'autre ait aussi changé et affecte le script.

source: If your key is detectable, make a note of the 3-digit hexadecimal value in the second column of the list (e.g. 159).
fr: Si votre touche est détectable, notez la valeur hexadécimale à 3 chiffres dans la deuxième colonne de la liste (par exemple 159).

source: If your key or mouse button is not detectable by the Key History screen, one of the following might help:
fr: si votre touche ou le bouton de la souris n'est pas détectable par l'écran Historique des touches, l'une des solutions suivantes peut vous aider:

source: If your keyboard layout has AltGr instead of RAlt, you can probably use it as a hotkey prefix via <^>! as described here.
fr: Si la disposition de votre clavier a AltGr au lieu de RAlt, vous pouvez probablement l’utiliser comme préfixe hotkey via <^>! comme décrit ici.

source: If your keyboard or mouse has a key not listed above, you might still be able to make it a hotkey by using the following steps:
fr: Si votre clavier ou souris possède une touche qui ne se trouve pas dans la liste ci-dessus, vous pourrez malgré peut-être en faire un hotkey en procédant comme suit:

source: IfEqual, IfNotEqual, IfLess, IfLessOrEqual, IfGreater and IfGreaterOrEqual
fr: IfEqual, IfNotEqual, IfLess, IfLessOrEqual, IfGreater et IfGreaterOrEqual

source: Implicit concatenation is also known as auto-concat.
fr: La concaténation implicite est aussi appelée auto-concat.

source: Implicit concatenation:
fr: Concaténation implicite :

source: In AutoHotkey v1, it is currently not possible to call a command from an expression, or to call a function using the command syntax.
fr: Dans AutoHotkey v1, il est actuellement impossible d'appeler une commande depuis une expression, ou d'appeler une fonction via la syntaxe de commande.

source: In Explorer, right-click in empty space in the folder where you want to save the script, then select New and AutoHotkey Script.
fr: Dans l'Explorateur de fichiers, clic droit sur un espace vide dans le dossier où sauvegarder le script, puis choisir Nouveau et AutoHotkey Script.

source: In Notepad (or a text editor of your choice), save a file with the .ahk filename extension.
fr: Dans Notepad (ou un éditeur de texte quelconque), enregistrer un fichier avec l'extension de fichier .ahk.

source: In Unicode builds, this should only occur if there are encoding errors in the script file or the codepages used to save and load the file don't match.
fr: Dans les constructions (builds) Unicode, ceci ne devrait arriver qu'en cas d'erreur d'encodage dans le fichier de script ou si les codepages utilisés pour la sauvegarde et le chargement du fichier sont différents.

source: In addition, %0% contains the number of parameters passed (0 if none).
fr: De plus, %0% contient le nombre de paramètres passés (0 si aucun).

source: In addition, LControl & RAlt:: would make AltGr itself into a hotkey.
fr: De plus, LControl & RAlt :: ferait d'AltGr lui-même un hotkey.

source: In addition, it prevents the translation of any explicitly specified escape sequences such as `r and `t.
fr: De plus, ceci empêche la traduction de n'importe quel séquence d'échappement indiquée explicitement comme `r et `t.

source: In addition, many of AutoHotkey's enhancements to the AutoIt v2 command set, as well as the Window Spy and the old script compiler, were adapted directly from the AutoIt v3 source code.
fr: De plus, beaucoup des améliorations dans AutoHotkey comparées à AutoIt v2, comme Window Spy et l'ancien compilateur de script, étaient directement adaptés du code source de AutoIt v3.

source: In addition, the
fr: De plus, les symboles

source: In addition, the above action occurs at the time the key is released.
fr: De plus, l'action ci-dessus se produit quand la touche est relachée.

source: In all other cases, the system default ANSI codepage is used.
fr: Dans tous les autres cas, le codepage par défaut du système ANSI est utilisé.

source: In all other places, they are treated literally as if they were normal characters.
fr: Partout ailleurs, ils sont traités littéralement comme s'ils étaient un caractère normal.

source: In an expression, both values can be simple values or complex sub-expressions.
fr: Dans une expression, les deux valeurs peuvent être de simples valeurs ou des sous-expressions complexes.

source: In an expression, literal text must be enclosed in quotation marks to differentiate it from a variable name or some other expression.
fr: Dans une expression, le texte littéral doit être entourés de guillemets pour le différencier d'un nom de variable ou d'une autre expression.

source: In both cases, the spaces preceding the variable and dot are mandatory.
fr: Dans les deux cas, les espaces avant la variable et le point sont obligatoires.

source: In expression mode, variables do not need percent signs.
fr: En mode expression, les variables n'ont pas besoin de signes pourcentage.

source: In fact, if the file is deleted immediately after use, it often does not actually get written to disk.
fr: En fait, si le fichier est supprimé immédiatement après utilisation, il n'est souvent pas du tout écrit sur le disque.

source: In most cases the percent prefix can be used to pass an expression.
fr: Dans la plupart des cas le préfixe pourcentage peut être utilisé pour passer une expression.

source: In old versions prior to revision 51, the program looked for AutoHotkey.ini in the working directory or AutoHotkey.ahk in My Documents.
fr: Dans de vieilles versions avant la révision 51, le programme cherchait AutoHotkey.ini dans le répertoire de travail ou AutoHotkey.ahk dans Mes Documents.

source: In other words, Beta is a name which has meaning to the object; it is not a local or global variable.
fr: En d'autres termes, Beta est un nom qui a une signification pour l'objet ; ce n'est pas une variable locale ou globale.

source: In other words, I want a certain key to act as it normally does except when a specific window is active.
fr: Autrement dit, je veux qu'une certaine touche agisse normalement sauf quand une certaine fenêtre est active.

source: In other words, UTF-8 files which lack a byte order mark are misinterpreted, causing non-ASCII characters to be decoded incorrectly.
fr: En d'autres termes, les fichiers UTF-8 sans indicateur d'ordre des octets sont mal interprétés, et les caractères hors ASCII sont décodés incorrectement.

source: In other words, if a command, assignment or expression is present on the same line as a hotkey label, it acts as though followed by return.
fr: En d'autres termes, si une commande, une affectation ou une expression est présente sur la même ligne qu'un label hotkey, le label se comporte comme s'il était suivi d'un return.

source: In other words, if the user has swapped the buttons via system settings, LButton:: is physically activated by clicking the right mouse button, but Send {LButton} performs the same as physically clicking the left button.
fr: Autrement dit, si l'utilisateur a échangé les boutons via les paramètres système, LButton :: est activé physiquement en cliquant sur le bouton droit de la souris, mais Send {LButton} effectue la même chose que de cliquer physiquement sur le bouton gauche.

source: In other words, if the user has swapped the buttons via system settings, RButton:: is physically activated by clicking the left mouse button, but Send {RButton} performs the same as physically clicking the right button.
fr: Autrement dit, si l'utilisateur a échangé les boutons via les paramètres système, RButton :: est activé physiquement en cliquant sur le bouton gauche de la souris, mais Send {RButton} effectue la même chose que de cliquer physiquement sur le bouton droit.

source: In other words, it inserts the values at the highest integer key plus one.
fr: En d'autres termes, les valeurs sont insérées à la plus haute clé entière plus un.

source: In other words, once the command's final parameter is reached (or there are no parameters), subsequent commas are treated as literal commas regardless of this option.
fr: En d'autres termes, une fois que le dernier paramètre de la commande est atteint (ou s'il n'y a pas de paramètres), les virgules suivantes sont traitées comme des virgules littérales sans tenir compte de cette option.

source: In other words, pressing the hotkey once will start the Loop.
fr: En d'autres termes, activer la hotkey une fois démarre la boucle.

source: In other words, they take effect unconditionally, before the script ever executes any control flow statements.
fr: En d'autres termes, ils prennent effet inconditionnellement, avant que le script exécute une quelconque instruction de flux de contrôle.

source: In other words, when a group of these statements is used as a whole, it does not always need to be enclosed in braces (however, some coding styles always include the braces, for clarity).
fr: En d'autres termes, quand un groupe de ces instructions est utilisé en entier, il n'y a pas toujours besoin d'utiliser des accolades autour (toutefois, pour des raisons de clarté, certains styles de code mettent les accolades).

source: In parameters that are input or output variables.
fr: Dans les paramètres qui sont des variables d'entrée ou de sortie.

source: In parameters that are input or output variables:
fr: Dans les paramètres qui sont des variables d'entrée ou de sortie :

source: In particular, device numbers are different and some components may be unavailable.
fr: En particulier, les nombres de périphérique sont différents et certains composants peuvent être indisponibles.

source: In short, you would probably want to choose UNICODE.
fr: Pour résumer, UNICODE est en général préférable.

source: In short:
fr: En résumé :

source: In silent install/uninstall mode, running scripts are closed automatically, where necessary.
fr: En mode installation/désinstallation silencieuse, les scripts en cours d'exécution sont automatiquement terminés, là où c'est nécessaire.

source: In some cases, software bundled with the mouse must instead be used to control this feature.
fr: Dans certains cas, le logiciel fourni avec une souris doit à la place être utilisé pour contrôler cette fonction.

source: In such cases, CapsLock is suppressed by the IME and cannot be detected by AutoHotkey.
fr: Dans de tels cas, VerrMaj est supprimé par l'IME et ne peut pas être détecté par AutoHotkey.

source: In the Text parameter of MsgBox, which has smart comma handling.
fr: Dans le paramètre Texte de MsgBox, qui gère les virgules intelligemment.

source: In the example below, you would hold down Numpad0 then press Numpad1 or Numpad2 to trigger one of the hotkeys:
fr: Dans l'exemple ci-dessous, il s'agit de maintenir Numpad0 enfoncé puis d'appuyer sur Numpad1 ou Numpad2 pour activer l'une ou l'autre des hotkeys :

source: In the example section of Edit you will find a script that allows you to change the default editor.
fr: Dans la section des exemples de Edit se trouve un script permettant de changer l'éditeur par défaut.

source: In the examples above, a series of lines is bounded at the top and bottom by a pair of parentheses.
fr: Dans les exemples ci-dessus, une série de ligne est délimitée en haut et en bas par une paire de parenthèses.

source: In the following code, both lines are run only if MyVar equals 5:
fr: Dans le code suivant, les deux lignes ne sont exécutées que si MaVar vaut 5 :

source: In the following code, the message box is only shown if MyVar equals 5.
fr: Dans le code suivant, la boîte de dialogue n'est affichée que si MaVar vaut 5.

source: In the following example, the second line is appended to the first because it begins with a comma:
fr: Dans l'exemple suivant, la seconde ligne est ajoutée à la première car elle commence par une virgule :

source: In the following examples, the expression is shown on the first line (beginning after the percent sign), with pure legacy syntax shown on the second line.
fr: Dans les exemples suivants, la première ligne utilise une expression (qui commence après le signe pourcentage), et la seconde ligne une pure syntaxe dépassée (legacy).

source: In the last parameter of any command.
fr: Dans le dernier paramètre de n'importe quelle commande.

source: In this case, I used the simple expression "Color", which is (unsurprisingly) the key Color.
fr: Dans ce cas, l'expression simple "Couleur", qui est (sans surprise) la clé Couleur.

source: In this example, the value "Yellow" is stored in the object key "Color".
fr: Dans cet exemple, la valeur "Jaune" est stocké dans la clé "Color" de l'objet,

source: In this example, the value "one" is stored in object key 1 (aka index 1), and the value 17 is stored in object key 4 (aka index 4).
fr: Dans cet exemple, la valeur "un" est stocké dans la clé 1 de l'objet (aussi appelée index 1), et la valeur 17 est stocké dans la clé 4 de l'objet (aussi appelée index 4).

source: Include the word Comments in the line above to make it a comment.
fr: Ajouter le mot Comments dans la ligne ci-dessus pour faire de ceci un commentaire.

source: Increase SetKeyDelay.
fr: Augmenter SetKeyDelay.

source: Increase the volume
fr: Augmenter le volume

source: Indentation has no set style, but it's best to keep everything consistent.
fr: Il n'y a pas de style universel, mais il est préférable qu'il soit constant.

source: Indented:
fr: Indenté :

source: Indicate that the script is being restarted (this is also used by the Reload command, internally).
fr: Indique que le script est redémarré (ceci est aussi utilisé par la commande Reload, en interne).

source: InputBox, OutputVar, Question 1, What is your first name?
fr: InputBox, VarSortie, Question 1, Quel est votre prénom ?

source: InputBox, OutputVar2, Question 2, Do you like AutoHotkey?
fr: InputBox, VarSortie2, Question 2, Aimez-vous AutoHotkey ?

source: InputVar
fr: VarEntree

source: Insert
fr: Inser

source: Insert (or Ins)
fr: Insert (ou Ins)

source: InsertAt method
fr: Méthode InsertAt (insérer à)

source: Inspect all variables or a specific variable.
fr: Inspecter toutes les variables ou une variable en particulier.

source: Install using command line options.
fr: Installer avec les options de ligne de commande.

source: Installer Options
fr: Options d'Installation

source: Instead of asking for help on every little thing, sometimes spending some time alone (sometimes hours or days) and trying to get something to work will help you learn faster.
fr: Au lieu de demander de l'aide sur chaque petit détail, passer seul du temps (parfois des heures voire des jours) à essayer de faire fonctionner quelque chose aide à apprendre plus vite.

source: Instead, values are concatenated by writing them in sequence, separated by a space or tab, or a dot surrounded by spaces.
fr: A la place, les valeurs sont concaténées en les écrivant dans l'ordre, séparées par un espace ou une tabulation, ou un point entouré d'espaces.

source: Instead, variables and other values can be combined with text through a process called concatenation.
fr: A la place, les variables et d'autres valeurs peuvent être combinées avec du texte en utilisant un processus appelé concaténation.

source: Interactive Debugging [AHK_L 11+]
fr: Débogage Interactif [AHK_L 11+]

source: Interactive debugging
fr: Débogage interactif

source: Interactive debugging is possible with a supported DBGp client.
fr: Le débogage interactif est possible avec un client DBGp pris en charge.

source: Is it possible to turn it into a hotkey?
fr: Est-il possible de l'utiliser pour une hotkey ?

source: Is it really a virus?
fr: Est-ce vraiment un virus ?

source: It can be followed by an Else statement, which executes only if the condition was not met.
fr: Elle peut être suivie d'une instruction Else (sinon), qui ne s'exécute que si la condition n'est pas vérifiée.

source: It can even be used to open URLs such as https://www.autohotkey.com/ . If your computer is setup to run the type of program you want to run, it's very simple:
fr: Elle permet aussi d'ouvrir des URLs comme https://www.autohotkey.com/. Si l'ordinateur est paramétré pour lancer le type de programme à lancer, c'est très simple :

source: It contains 1 the first time the loop's body is executed.
fr: Elle contient 1 la première fois que le corps de la boucle est exécuté.

source: It has no special meaning when used in an assignment or comparison, so is interpreted literally in such cases.
fr: Elle n'a pas de signification particulière si elle est utilisée dans une affectation ou une comparaison, donc est interprété littéralement dans ces cas-là.

source: It has support for non-English letters and numbers (characters).
fr: Il permet l'utilisation de lettres, nombres et caractères non-anglais.

source: It is a key or key combination that the person at the keyboard presses to trigger some actions.
fr: C'est une touche ou une combinaison de touches que la personne devant le clavier presse pour déclencer des actions.

source: It is generally best to insert these "break points" at positions where the active window does not matter to the script, such as immediately before a WinActivate command.
fr: Il est en général mieux d'insérer ces "points d'arrêt" à des positions où la fenêtre active n'a pas d'influence sur le script, comme par exemple immédiatement avant une commande WinActivate.

source: It is not supported by the other Loop sub-commands or legacy If statement, as the brace would be interpreted as a literal { character.
fr: Il n'est pas pris en charge par les autres sous-commandes Loop ou instructions If dépassées (legacy), puisque l'accolade serait interprétée comme un caractère littéral {.

source: It is possible to tell that the key still exists by using the HasKey method, and it will still come up in a For loop.
fr: Il est possible de voir que la clé existe encore en utilisant la méthode HasKey, et la clé sera toujours traitée dans une boucle For.

source: It is unclear how this situation arises or whether it is normal, but experimenting with the joystick number in the joystick test script can help determine if this applies to your system.
fr: On ne sait pas comment cette situation se produit ou si elle est normale, mais vous pouvez expérimenter le numéro du joystick dans le script de test du joystick pour aider à déterminer si cela s'applique à votre système.

source: It literally stops code from going any further, to the lines below.
fr: Cette ligne stoppe littéralement le code, l'empêche d'aller plus loin, aux lignes suivantes.

source: It may also be necessary to repair the default registry values, either by reinstalling AutoHotkey or by running AutoHotkey Setup (from the Start menu) and selecting apply near the top of the window.
fr: Il peut aussi être nécessaire de réparer les valeurs par défaut du registre, soit en réinstallant AutoHotkey soit en lançant AutoHotkey Setup (depuis le menu Démarrer) et en sélectionnant apply vers le haut de la fenêtre.

source: It must end with a .ahk extension.
fr: Il doit terminer par l'extension .ahk.

source: It's a good feeling, making something yourself without help.
fr: C'est un sentiment agréable, de faire quelque chose sans l'aide de personne.

source: It's also possible with some rudimentary methods using Gui, but in a limited way.
fr: C'est aussi possible avec des méthodes rudimentaires utilisant Gui, mais de manière limitée.

source: It's best you learn to indent ASAP.
fr: Il est mieux d'apprendre à indenter dès que possible.

source: It's exactly the same as above, but I outdented the second line so we know it's separated from the if-statement:
fr: Le même code, mais sans l'indentation sur la seconde ligne pour montrer qu'elle est séparée de l'instruction if :

source: It's how AHK knows that {!} means "exclamation point" and not "press the Alt key".
fr: C'est la manière pour AutoHotkey de savoir que {!} veut dire "point d'exclamation" et pas "appuyer sur la touche Alt".

source: It's important to remember that every one of these definitions all create the same thing (objects), just with different keys.
fr: Il est important de garder à l'esprit que chacune de ces définitions crée la même chose (des objets), juste avec des clés différentes.

source: It's simply spacing to break up your code so you can see what belongs to what.
fr: Simplement des espaces au sein du code pour l'aérer et voir ce qui appartient à quoi.

source: It's usually not the same as F1.
fr: Ce n'est généralement pas la même chose que F1.

source: Items under the View menu control what the main window displays:
fr: Les options sous le menu View contrôlent ce que la fenêtre principale affiche :

source: Just kidding.
fr: C'était une blague.

source: Just like hotkeys, the Send command has special keys too.
fr: Comme pour les hotkeys, la commande Send a aussi des touches spéciales.

source: Keep going until you see an Install button.
fr: Continuer jusqu'au bouton "Install".

source: Keep trying and failing until your code fails no more.
fr: Continuer à essayer et rater jusqu'à ce que le code ne rate plus.

source: KeepWinZRunning := false
fr: ContinuerExecutionWinZ := false

source: KeepWinZRunning := true
fr: ContinuerExecutionWinZ := true

source: Key history and script info - See KeyHistory.
fr: Key history and script info (historique des touches et infos sur le script) - Voir KeyHistory.

source: Keyboard
fr: Clavier

source: Keyboard and mouse:
fr: Clavier et souris:
